# file location: ${HOME}/dots-macos/Brewfile
# Usage: brew bundle install --file=~/dots-macos/Brewfile
#
# Aliases:
#   alias bbd='brew bundle dump --force --file=~/dots-macos/Brewfile'
#   alias bbi='brew bundle install --file=~/dots-macos/Brewfile'
#   alias bbc='brew bundle check --file=~/dots-macos/Brewfile'
#   alias bbclean='brew bundle cleanup --file=~/dots-macos/Brewfile'

# Install all casks to /Applications and adopt any existing app already present
cask_args appdir: "/Applications", fontdir: "/Library/Fonts", adopt: true

# ---- Taps ----
tap "coder/coder", trusted: true
tap "felixkratz/formulae", trusted: true
tap "hashicorp/tap", trusted: true
tap "jandedobbeleer/oh-my-posh", trusted: true
tap "jesseduffield/lazygit", trusted: true
tap "lizardbyte/homebrew", trusted: true
tap "microsoft/git", trusted: true
tap "nikitabobko/tap", trusted: true

# ---- Formulae ----
brew "aria2"
brew "astroterm"
brew "black"
brew "btop"
brew "cbonsai"
brew "curl"
brew "duti"
brew "eza"
brew "fd"
brew "felixkratz/formulae/borders", trusted: true
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-extras"
brew "git-lfs"
brew "git"
brew "go"
brew "grep"
brew "hashicorp/tap/nomad", trusted: true
brew "hashicorp/tap/vault", trusted: true
brew "imagemagick"
brew "jandedobbeleer/oh-my-posh/oh-my-posh", trusted: true
brew "lazygit"
brew "luarocks"
brew "mosh"
brew "neovim"
brew "openjdk"
brew "php"
brew "prettier"
brew "protobuf"
brew "ripgrep"
brew "rsync"
brew "ruby", link: false
brew "ruff"
brew "rustup"
brew "sapling"
brew "sd"
brew "stow"
brew "temporal"
brew "tlrc"
brew "tmux"
brew "topgrade"
brew "trash"
brew "tree-sitter-cli"
brew "tree-sitter"
brew "tree"
brew "uv"
brew "watchman"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zoxide"

# ---- Casks ----
cask "alcove"
cask "aldente"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "asana"
cask "bettertouchtool"
cask "bitwarden"
cask "blackhole-2ch"
cask "clop"
cask "coder/coder/coder-desktop"
cask "cursor"
cask "discord"
cask "finicky"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "iina"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "linearmouse"
cask "lookaway"
cask "miniconda"
cask "monitorcontrol"
cask "nikitabobko/tap/aerospace"
cask "obsidian"
cask "shottr"
cask "slack"
cask "spotify"
cask "wechat"
