# file location: ${HOME}/dots-macos/Brewfile
# Usage: brew bundle install --file=~/dots-macos/Brewfile
#
# Aliases:
#   alias bbd='brew bundle dump --force --file=~/dots-macos/Brewfile'
#   alias bbi='brew bundle install --file=~/dots-macos/Brewfile'
#   alias bbc='brew bundle check --file=~/dots-macos/Brewfile'
#   alias bbclean='brew bundle cleanup --file=~/dots-macos/Brewfile'

# Install all casks to /Applications and adopt any existing app already present
cask_args appdir: "/Applications", fontdir: "/Library/Fonts", adopt: true

# ---- Taps ----
tap "coder/coder"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "itsfrank/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "lizardbyte/homebrew"
tap "microsoft/git"
tap "nikitabobko/tap"

# ---- Formulae ----
brew "black"
brew "btop"
brew "duti"
brew "eza"
brew "fd"
brew "felixkratz/formulae/borders"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-extras"
brew "git-lfs"
brew "git"
brew "go"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/vault"
brew "imagemagick"
brew "itsfrank/tap/portpal"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "openjdk"
brew "php"
brew "prettier"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "ruff"
brew "rustup"
brew "sapling"
brew "sd"
brew "stow"
brew "temporal"
brew "tlrc"
brew "tmux"
brew "topgrade"
brew "trash"
brew "tree-sitter-cli"
brew "tree-sitter"
brew "tree"
brew "uv"
brew "watchman"
brew "wget"
brew "zoxide"

# ---- Casks ----
cask "alcove"
cask "aldente"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "asana"
cask "bitwarden"
cask "coder/coder/coder-desktop"
cask "crossover"
cask "cursor"
cask "dcv-viewer"
cask "discord"
cask "dotnet-sdk"
cask "epic-games"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty@tip"
cask "git-credential-manager"
cask "iina"
cask "itsfrank/tap/portpal-app"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "kitty"
cask "linearmouse"
cask "logitech-g-hub"
cask "lookaway"
cask "miniconda"
cask "monitorcontrol"
cask "neteasemusic"
cask "nikitabobko/tap/aerospace"
cask "obsidian"
cask "opal-app"
cask "postman"
cask "prefs-editor"
cask "prismlauncher"
cask "qflipper"
cask "rider"
cask "slack"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "wechat"
cask "wispr-flow"
cask "zoom"
